In [9]:
import sqlite3
import pandas as pd

### I created the database and the table using the SQL Lite browser
### I am using the python code to retrieve the data from the table and showing as a pandas dataframe
### I have submitted the SQL Lite database as db_dsc540 along with the code

In [4]:
# Opening a connection object to connect to the database
con = sqlite3.connect('db_dsc540')

In [5]:
# Executing the query as a select statement to fetch data from the table: customer
cursor = con.execute('select * from customer')

In [6]:
# Fetching all the data into a cursor object after executing the select statement
rows = cursor.fetchall()

In [7]:
# Showing the output as a list
rows

[('Customer1', '12234 State Str', 'Omaha', 'NE', '56789', 2345671234),
 ('Customer2', '1001 One Street', 'Lincoln', 'NE', None, None),
 ('Customer3', '12345 Pacific Str', 'Omaha', 'NE', '68144', 7689813456),
 ('Customer4', '6789 California St', 'Omaha', 'NE', '78996', 6789875432),
 ('Customer5',
  'Apt 102, Oliva gardens',
  'IOWA City',
  'IA',
  '76543',
  5678901234),
 ('Customer6', '1 High Street', 'Chicago', 'IL', '98989', 7654321987),
 ('Customer7', '2 Cinnamon Cir', 'Boston', 'MA', '09876', 7890986543),
 ('Customer8', '28 Loan Str', 'New York', 'NY', '76760', 8976541234),
 ('Customer9', '1111 Wall Str', 'Chicago', 'IL', '98765', 8765431234),
 ('Customer10', '12345 Eagle Run', 'Omaha', 'NE', '87654', 8975432123),
 ('Customer11', '21 Lincoln Dr', 'Gretna', 'NE', '87870', '')]

In [8]:
# The below code shows the description of the columns from the table
cursor.description

(('cust_name', None, None, None, None, None, None),
 ('cust_address', None, None, None, None, None, None),
 ('cust_city', None, None, None, None, None, None),
 ('cust_state', None, None, None, None, None, None),
 ('cust_zip', None, None, None, None, None, None),
 ('cust_phone', None, None, None, None, None, None))

In [10]:
# Loading the data from the rows object into a pandas dataframe
# getting the column names from the description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

,cust_name,cust_address,cust_city,cust_state,cust_zip,cust_phone
0,Customer1,12234 State Str,Omaha,NE,56789,2345671234
1,Customer2,1001 One Street,Lincoln,NE,None,None
2,Customer3,12345 Pacific Str,Omaha,NE,68144,7689813456
3,Customer4,6789 California St,Omaha,NE,78996,6789875432
4,Customer5,"Apt 102, Oliva gardens",IOWA City,IA,76543,5678901234
5,Customer6,1 High Street,Chicago,IL,98989,7654321987
6,Customer7,2 Cinnamon Cir,Boston,MA,09876,7890986543
7,Customer8,28 Loan Str,New York,NY,76760,8976541234
8,Customer9,1111 Wall Str,Chicago,IL,98765,8765431234
9,Customer10,12345 Eagle Run,Omaha,NE,87654,8975432123
10,Customer11,21 Lincoln Dr,Gretna,NE,87870,